tutorials/Matyas_old/channelCaseConstructor2D/10_baseCaseVSpaciV4/system/createPatchDict.2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
pointSync false;
patches
(
        {
                name    inletCyl;
                patchInfo
                {
                        type patch;
                }
                constructFrom   set;
                set inletCyl;
        }
);
